function checkVal(__left, __right) {
  if (__left == __right) {
    return 1;
  }
  if (
    (__left == "الحوت" && __right == "الدلو") ||
    (__left == "الدلو" && __right == "الحوت") ||
    (__left == "الجدي" && __right == "الدلو") ||
    (__left == "الدلو" && __right == "الجدي") ||
    (__left == "الجدي" && __right == "القوس") ||
    (__left == "القوس" && __right == "الجدي") ||
    (__left == "العقرب" && __right == "القوس") ||
    (__left == "القوس" && __right == "العقرب") ||
    (__left == "العقرب" && __right == "الميزان") ||
    (__left == "الميزان" && __right == "العقرب") ||
    (__left == "العذراء" && __right == "الميزان") ||
    (__left == "الميزان" && __right == "العذراء") ||
    (__left == "العذراء" && __right == "الاسد") ||
    (__left == "الاسد" && __right == "العذراء") ||
    (__left == "السرطان" && __right == "الاسد") ||
    (__left == "الاسد" && __right == "السرطان") ||
    (__left == "السرطان" && __right == "الجوزاء") ||
    (__left == "الجوزاء" && __right == "السرطان") ||
    (__left == "الثور" && __right == "الجوزاء") ||
    (__left == "الجوزاء" && __right == "الثور") ||
    (__left == "الثور" && __right == "الحمل") ||
    (__left == "الحمل" && __right == "الثور") ||
    (__left == "الحوت" && __right == "الحمل") ||
    (__left == "الحمل" && __right == "الحوت")
  ) {
    return 2;
  }
  if (
    (__left == "الجدي" && __right == "الحوت") ||
    (__left == "الحوت" && __right == "الجدي") ||
    (__left == "الدلو" && __right == "القوس") ||
    (__left == "القوس" && __right == "الدلو") ||
    (__left == "العقرب" && __right == "الجدي") ||
    (__left == "الجدي" && __right == "العقرب") ||
    (__left == "القوس" && __right == "الميزان") ||
    (__left == "الميزان" && __right == "القوس") ||
    (__left == "العذراء" && __right == "العقرب") ||
    (__left == "العقرب" && __right == "العذراء") ||
    (__left == "الميزان" && __right == "الاسد") ||
    (__left == "الاسد" && __right == "الميزان") ||
    (__left == "السرطان" && __right == "العذراء") ||
    (__left == "العذراء" && __right == "السرطان") ||
    (__left == "الاسد" && __right == "الجوزاء") ||
    (__left == "الجوزاء" && __right == "الاسد") ||
    (__left == "الثور" && __right == "الحوت") ||
    (__left == "الحوت" && __right == "الثور") ||
    (__left == "الثور" && __right == "السرطان") ||
    (__left == "السرطان" && __right == "الثور") ||
    (__left == "الدلو" && __right == "الحمل") ||
    (__left == "الحمل" && __right == "الدلو") ||
    (__left == "الجوزاء" && __right == "الحمل") ||
    (__left == "الحمل" && __right == "الجوزاء")
  ) {
    return 3;
  }
  if (
    (__left == "الحوت" && __right == "القوس") ||
    (__left == "القوس" && __right == "الحوت") ||
    (__left == "العقرب" && __right == "الدلو") ||
    (__left == "الدلو" && __right == "العقرب") ||
    (__left == "الجدي" && __right == "الميزان") ||
    (__left == "الميزان" && __right == "الجدي") ||
    (__left == "العذراء" && __right == "القوس") ||
    (__left == "القوس" && __right == "العذراء") ||
    (__left == "العقرب" && __right == "الاسد") ||
    (__left == "الاسد" && __right == "العقرب") ||
    (__left == "السرطان" && __right == "الميزان") ||
    (__left == "الميزان" && __right == "السرطان") ||
    (__left == "الحوت" && __right == "الجوزاء") ||
    (__left == "الجوزاء" && __right == "الحوت") ||
    (__left == "العذراء" && __right == "الجوزاء") ||
    (__left == "الجوزاء" && __right == "العذراء") ||
    (__left == "الثور" && __right == "الدلو") ||
    (__left == "الدلو" && __right == "الثور") ||
    (__left == "الثور" && __right == "الاسد") ||
    (__left == "الاسد" && __right == "الثور") ||
    (__left == "الجدي" && __right == "الحمل") ||
    (__left == "الحمل" && __right == "الجدي") ||
    (__left == "السرطان" && __right == "الحمل") ||
    (__left == "الحمل" && __right == "السرطان")
  ) {
    return 4;
  }
  if (
    (__left == "الحوت" && __right == "الميزان") ||
    (__left == "الميزان" && __right == "الحوت") ||
    (__left == "العذراء" && __right == "الدلو") ||
    (__left == "الدلو" && __right == "العذراء") ||
    (__left == "الحوت" && __right == "الاسد") ||
    (__left == "الاسد" && __right == "الحوت") ||
    (__left == "الجدي" && __right == "الاسد") ||
    (__left == "الاسد" && __right == "الجدي") ||
    (__left == "السرطان" && __right == "الدلو") ||
    (__left == "الدلو" && __right == "السرطان") ||
    (__left == "السرطان" && __right == "القوس") ||
    (__left == "القوس" && __right == "السرطان") ||
    (__left == "الجدي" && __right == "الجوزاء") ||
    (__left == "الجوزاء" && __right == "الجدي") ||
    (__left == "العقرب" && __right == "الجوزاء") ||
    (__left == "الجوزاء" && __right == "العقرب") ||
    (__left == "الثور" && __right == "القوس") ||
    (__left == "القوس" && __right == "الثور") ||
    (__left == "الثور" && __right == "الميزان") ||
    (__left == "الميزان" && __right == "الثور") ||
    (__left == "العقرب" && __right == "الحمل") ||
    (__left == "الحمل" && __right == "العقرب") ||
    (__left == "العذراء" && __right == "الحمل") ||
    (__left == "الحمل" && __right == "العذراء")
  ) {
    return 6;
  }
  if (
    (__left == "الحمل" && __right == "الميزان") ||
    (__left == "الميزان" && __right == "الحمل") ||
    (__left == "الجوزاء" && __right == "القوس") ||
    (__left == "القوس" && __right == "الجوزاء") ||
    (__left == "السرطان" && __right == "الجدي") ||
    (__left == "الجدي" && __right == "السرطان") ||
    (__left == "الاسد" && __right == "الدلو") ||
    (__left == "الدلو" && __right == "الاسد") ||
    (__left == "العقرب" && __right == "الثور") ||
    (__left == "الثور" && __right == "العقرب") ||
    (__left == "العذراء" && __right == "الحوت") ||
    (__left == "الحوت" && __right == "العذراء")
  ) {
    return 7;
  }
  if (
    __water.includes(__left) &&
    __water.includes(__right) &&
    __right != __left
  ) {
    return 5;
  }
  if (
    __water.includes(__right) &&
    __water.includes(__left) &&
    __right != __left
  ) {
    return 5;
  }
  if (
    __stone.includes(__left) &&
    __stone.includes(__right) &&
    __right != __left
  ) {
    return 5;
  }
  if (
    __stone.includes(__right) &&
    __stone.includes(__left) &&
    __right != __left
  ) {
    return 5;
  }
  if (
    __fire.includes(__left) &&
    __fire.includes(__right) &&
    __right != __left
  ) {
    return 5;
  }
  if (
    __fire.includes(__right) &&
    __fire.includes(__left) &&
    __right != __left
  ) {
    return 5;
  }
  if (
    __wind.includes(__left) &&
    __wind.includes(__right) &&
    __right != __left
  ) {
    return 5;
  }
  if (
    __wind.includes(__right) &&
    __wind.includes(__left) &&
    __right != __left
  ) {
    return 5;
  }
}
