// هنا التغيير في رسالة عند الضغط علي الحالات الاربعة التي بالاسفل
export let planetMessages = {
  ex: "اكتب الرسالة هنا", // ممتاز
  good: "اكتب الرسالة هنا", // جيد
  normal: "اكتب الرسالة هنا", // عادي
  bad: "اكتب الرسالة هنا", // غير ملائمة
};

export const daysInfo = [
  {
    title1: "إذا دخلت السنة يوم الأحد",
    title2: "اذا كان السادس من صفر يوم الأحد",
    description1:
      "إذا دخلت السنة يوم الأحد كان طالعها الشمس ونجمها الأسد فتكون سنة باردة ويكون صيفها صالحاً وتكون سنة ممطرة جيدة رخية ويكون فيها وجع العيون وموت الصبيان وتعسير الحبالى ويهيج فيها حرب عظيم بين الفرس والعجم وتظهر فيها الجراد ويقتل فيها سلطان من العرب وينكسف فيها القمر ويرجع الحجاج سالمين وخريفها جيد وصيفها جيد وأولها خير من آخرها ويكون في البُر والشعير عاهة يكيل كيلاً عظيماً وتكثر فيها الفتنة ثم يصلح الزرع وتكثر البركة فيه وتثمر النخل والأشجار وتكون الكرام مثمرة ويصلح بلاد العرب وتفسد بلاد العجم ويصلح التزويج والبيع والشراء ويكثر النخل والذرة ويصيب العدس والباقل عاهة ويجود الدخن والجوز وتفسد النخل والسدر ويصلح العنب والرمان في كل بلاد ويظهر في الناس الحكاك والجرب ويكثر اللبن في الخريف والله أعلم.",
    description2:
      "فان تلك السنة شديدة قليلة المطر في الخريف ويهلك فيها الطير ويكون فيها حمّى وبلاء وينال الناس جوع وقلة من الطعام والله أعلم",
  },
  {
    title1: "إذا دخلت السنة يوم الأثنين",
    title2: "اذا كان السادس من صفر يوم الأثنين",
    description1:
      "إذا دخلت السنة يوم الإثنين كان طالعها القمر ونجمها السرطان وتكون سنة مائية كثيرة الأثمار والبانها غزير في المشرق والمغرب ولكن فيها حرب عظيم ثمارها كثيرة ويثمر النخل ويصلح المواشي ويكثر الحب والسمن واللحم والشحم وتشتمل الجبال بالخضرة وهي سنة باردة ورياحها كثيرة ويقع في الغنم والضأن هلاك في آخر السنة والبقر تموت وهي سنة شديدة حرّها وبردها وسهل الأرض خير من جبالها ويقع في ظهور الناس وجع ويقع يخطى في الشعير ويصلح البر ويصيب العدس والسمسم والسدر والكراث والتفاح عاهة ويخط الدخن وتكون شحة كثيرة ويصلح الزواج وأن تغلّب الآبق لا يرجع ويصلح الحج ولا بد من الخلاف في العراقين ويخرج العرب من بلاد الى بلاد ويصيب الزرع حمرة وبياض ولا يضره شيء والله أعلم .",
    description2:
      "إذا كان سادس صفر يوم الاثنين فإن تلك السنة يكون فيها خوف ورمد ويكثر العسل وترتفع الأسعار في آخرها ويموت فيها ملك كبير وتكون كثيرة الحروب والفتن ويظهر فيها الجراد ويقل فيها الزرع ويصلح فيها العنب والله أعلم",
  },
  {
    title1: " إذا دخلت السنة يوم الثلاثاء",
    title2: "اذا كان السادس من صفر يوم الثلاثاء",
    description1:
      "وإذا دخلت السنة بالثلاثاء كان طالعها المريخ ونجمها العقرب وتكون سنة سليمة أولها صحة وشدة وآخرها رخاء قليل الفتن بين العرب ويقع الربو في الصبيان والشيوخ من الرجال والنساء ويظهر الجراد ويقع الفتن في البلاد وتقع هزيمة عظيمة وتقع شدة ويظهر ملك يبلغ اليمن ويرجع ويظهر في الشام حرب عظيم ويزول ملكه ويظهر ملك آخر ويبلغ البُر صاعين بدينار ويرخص التوت ويكثر صيد البحر في آخر السنة وتغلو الدراهم والدنانير  ويكثر الماء في الصيف ويكثر الزرع في جميع البلاد ويكثر اللبن في الغنم ويحسن خريفها ويقع النقص في الدخن ويظهر البيع والشراء ويبارك الله فيه والله أعلم .",
    description2:
      "إذا كان سادس صفر يوم الثلاثاء فإن تلك السنة كثيرة الأمطار مباركة ويكون السلامة من اليمن ويكثر الحجاج من أهل اليمن والشام وتكون السنة طيبة جيدة والله أعلم",
  },
  {
    title1: " إذا دخلت السنة يوم الأربعاء",
    title2: "اذا كان السادس من صفر يوم الأربعاء",
    description1:
      "إذا دخلت السنة يوم الاربعاء فله من البروج السنبلة ومن الكواكب عطارد يدل على كثرة الأوجاع والوباء ويكون الحر قوياً ويحدث بين الناس الشر وتكثر الألبان والعدس والشعير وتصلح الاشجار والثمار في جميع البلاد وتكثر الأمراض من الصفراء وتنبع العيون ويكثر فيها الحرب وتموت فيها الحوامل وتكثر الزنابير ويرتفع السل من كثرة الفواحش ويصلح الكروم وتسمن البهائم ويقع في الإبل الهيام والكلف ويصلح البيع والشراء ويصيب الناس ريح القولنج في قلوبهم ويموت كبار الناس ويصلح الربيع والخريف ويقع في الشام برد وحرة ويقع في الخريف نقص وتخرب في بلاد اليمن مدينة ويشد البرد ويقع في الصيف مطر ويصلح في الجبال البر وفي تهامة الذرة والدخن والسمسم وتهيج النساء على الرجال ويأتي على الناس في آخر السنة رياح كثيرة ويغلو التوت والله أعلم ",
    description2:
      "إذا كان يوم الأربعاء سادس صفر فإن تلك السنة رخية الأسعار وتكثر فيها المواشي وتموت فيها الحوامل من النساء ويسقط ملك عظيم ويكثر فيها المرض وينكسف فيها القمر في شهر ربيع الآخر وتكون تلك السنة تامة كثيرة الأمطار في الصيف والخريف ويغلا فيها الذهب والفضة ويرخص المكيول ويغلا المكبوس والله أعلم ",
  },
  {
    title1: " إذا دخلت السنة يوم خميس",
    title2: "اذا كان السادس من صفر يوم خميس",
    description1:
      "إذا دخلت السنة يوم الخميس كان طالعها المشتري وبرجها القوس يدل على كثرة المطر وهي سنة جافة مغلية الاسعار ويقع في البر والزرع عاهة وترمح الأرض وتكون سنة منكوس آخرها خير من أولها ويصلح الشام ويقع في اليمن خطة وتنكشف ويهيج البحر ويكثر المطر في آخر السنة ويصلح الخريف ويكثر الصيد وتكثر الفكرة والندم ويخرج خارجي ويحصل في الأرض زلزلة ويقع في البحار موت والصبيان يموتون من رياح تعرض لهم والله أعلم",
    description2:
      "إذا كان سادس صفر يوم الخميس فإن تلك السنة كثيرة الخوف والجراد والجراد وتموت فيها الغنم ويقع فيها زلزلة عظيمة ويتأخر الصيف ويكثر ويغلا فيها الطعام ويكثر فيها أولاد الزنى وتخرج فيها خارجة من المغرب يضعف سلاطين اليمن والله أعلم",
  },
  {
    title1: " إذا دخلت السنة يوم الجمعة",
    title2: "اذا كان السادس من صفر يوم الجمعة",
    description1:
      "إذا دخلت السنة يوم الجمعة كان طالعها الزهرة ولها من البرج الميزان والثور تكون سنة مباركة كثيرة الرياح العواصف وكثيرة المطر ويظهر ملك يدّعي الأمر ويغلو الشعير ويصلح السدر والمواشي وتكثر الألبان وتصلح البهائم والإبل ويقع آية ومشقة شديدة من هذه السنة ويكون المطر في الصيف والخريف غزير ويقع بعض نهب في بعض القرى ويكثر وجع الحلق ووجع الظهر ويظهر الكلْب الكَلِب ويكون في الصيف رياح القتول حتى يعطش الزرع من الشدة ويضعف ثمر النخل والبر ويصلح العنب ويخرص التوت.ويقع في الغنم ويكثر ويقل صيد البحر. والبقر تهزل ويكثر طير الارض ويصيد الناس ويقع في الحجاز خلاف ويكثر القتل والأخذ والنهب وتسقط النساء أولادهن ويعسر الحبالى ويموت منهن كثير وتصلح السنة في آخرها ويقع المطر في آخر السنة وتكثر الالبان والسمسم في آخرها ويظهر في مكة من الشام أمير عظيم وينزل من مدينة النبي عليه السلام ويخرجون عليهم ويُنصَرون ويصيب سكان مكة شدة عظيمة وتكثر الجدري والجراد وآخر السنة خير من أولها ويخشى على مكة من صغار العيون وينكسف أحد النيرين وتكون سنة شديدة ويهلك الملوك ويظهر نجم له ذوابة والله أعلم",
    description2:
      "إذا كان سادس صفر يوم الجمعة فإن تلك السنة تكون لينة الشتاء ويرخص فيها الطعام ويصلح فيها جميع الثمار والبهائم ويكثر فيها الإسلام والإيمان الى ان ينكسف الهلال في شعبان فإنه يغلا الطعام ويتأخر الصيف والله أعلم",
  },
  {
    title1: " إذا دخلت السنة يوم السبت",
    title2: "اذا كان السادس من صفر يوم السبت",
    description1:
      "إذا دخلت السنة يوم السبت يكون الطالع زحل وبرجها يدل على أنه تكون سنة غير صالحة للمواشي وتهلك الجمال من آفة يصيبها وتكون الرياح كثيرة ويكثر الحرب فيها والنهب ويكثر الجدري ويظهر وجع الحلق ويكثر الطير طير الدوائر ويكثر رياح القتول ويفسد شيئا من ثمر النخل ويكثر العنب ويغلو التوت والسمن واللحم ويهلك أولاد الغنم ويقع في الناس مرارة ونهب ويكثر إسقاط الحبالى ويكثر الطلاق ويكون المطر في أول سنة في العراق ويموت المشايخ والنساء ويكثر السليط ويقع في أرض اليمن اختلاف عظيم ويقبل الرياح ويقع في الحجاز فزع عظيم ويخاف على الحجاج وينكسف أحد النيرين ويكثر الحمى والوباء ويكثر الجراد وتكون سنة عظيمة جافة والله أعلم",
    description2:
      "إذا كان سادس صفر يوم السبت فإن تلك السنة تكون صلاح اليهود وسعدهم ويكون فيها صلاح المواشي والزرع ويرخص فيها كل موزون ويموت فيها ملك عظيم والله اعلم",
  },
];
export const weeks = {
  "0night": [
    // ساعات الاحد مساءا
    {
      planet: "عطارد",
      status: "normal",
      msg: "تصلح للتزويج والركوب الى العظماء والنقلة ولبس الجدد ويكره فيها تأديب الصبيان",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "تصلح للإبتناء بالأبكار ولبس الجدد وشرب الدواء ودخول الحمام",
    },
    { planet: "زحل", status: "bad", msg: "ساعة ردية لكل عمل" },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح للدخول بالنساء الحراير ولبس الجدد ويكره فيها جماع الإماء",
    },
    { planet: "مريخ", status: "bad", msg: "مذمومة يكره فيها كل عمل " },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح لكل ابتداء ول سيما لما يتعلق بالنساء",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "موافقة لما يتعلق بالعذارى ولبس الجدد والنقلة",
    },
    { planet: "عطارد", status: "normal", msg: "مذمومة لكل ابتداء ولكل عمل" },
    {
      planet: "قمر",
      status: "good",
      msg: "تصلح للجماع وشرب الدواء وكنز الاموال",
    },
    { planet: "زحل", status: "bad", msg: "مذمومة جداً لكل عمل" },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح للسفر في البر والبحر ولبس الجدد ",
    },
    {
      planet: "مريخ",
      status: "bad",
      msg: "تصلح للسفر ولبس الجديد وكل ابتداء في كل الأعمال",
    },
  ],
  "0light": [
    // ساعات الاحد صباحا
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح للقاء الملوك وحمل الهدايا اليهم وطلب الحوائج منهم ومصادقة الأشراف وشراء الخدام",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "تصلح لغرس الشجر وبيع الجواري واتخاذ الأطعمة وأخذ الشعر والزينة ولكل ما يراد به الفرح",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "تصلح أن يكتب فيها البراءة والعهد والكتب الى الملوك وتسليم الصبيان الى التعليم ونقش وجميع النقوش ويكره فيها شراء الرقيق",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "يكره فيها الابتداء بالخصومة والتزويج ويكره فيها بيع الرقيق وبالجملة ابتداء بكل عمل",
    },
    {
      planet: "زحل",
      status: "bad",
      msg: "تصلح لتسليم المواشي لمن يرعها ولشراء الرقيق والدواب والغنم والزراعة والبناء",
    },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح للقاء الملوك والأشراف وقرض المال واستعمال العمال وطلب الاولاد الذكور وغرس الشجر ونشر الذكر",
    },
    {
      planet: "مريخ",
      status: "bad",
      msg: "يكره الابتداء فيه بكل عمل من بيع وشراء وغير ذلك",
    },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح للأشراف لا لملوك وتحمد الغرس للشجر وتأسيس المدر وكل بناء وشراء الخدم والدواب والإبل ولقاحها",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "تحمد للركوب للفرح والغرس للأشجار والتزويج وشراء الرقيق والغنم والدواب ولبس الجدد ودخول الحمام وغسل الرأس",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "تصلح لمكاتبة الملوك والعظماء وتعليم الصبيان والبيع والشراء إلا الرقيق والثياب",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "تصلح لشراء الرقيق والبقر والدواب والغنم وحفر الآبار وأجراء الأنهار وغرس الاشجار واستعمال الرعاة والأمناء ومساحة الارضين والصدقة على المساكين",
    },
    {
      planet: "زحل",
      status: "bad",
      msg: "ساعة ردية ولا خير فيها لكل ابتداء ومعاملة واستعمال ومكاتبة لا تصلح لسوء الخلق",
    },
  ],
  "1night": [
    // ساعات الاثنين مساءا
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح لكل ابتداء وللدخول بالنساء ولبس الثياب الجدد والنقلة الى موضع ومكاتبة السلاطين وشرب الدواء ويكره فيها الخصومة ومفاسد الأهل والأصل",
    },
    { planet: "مريخ", status: "bad", msg: "يكره فيها كل ابتداء" },
    {
      planet: "شمس",
      status: "good",
      msg: "صالحة لكل عمل من معالجة وسفر ولباس الجدد والنقلة من دار الى دار",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "صالحة لأمور النساء والقينات والجماع وان اتفق فيها ولادة كان في غاية السعادة ذكراً أو أنثى",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "صالحة للكتب والاسفار ومجامعة الإماء والتفصيل ولبس الجدد ودفن المال ولا خير في جماع الحراير فيها",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "يحمد فيها السفر برا أو بحراً أو لمجامعة الحراير ولبس الجدد وشرب الدواء والنقلة من دار الى دار",
    },
    { planet: "زحل", status: "bad", msg: "ردية يكره فيها الأعمال" },
    {
      planet: "مشتري",
      status: "ex",
      msg: "صالحة لكل عمل ولاسيما النكاح ولبس الجدد والنقلة وشرب الداوء",
    },
    {
      planet: "مريخ",
      status: "bad",
      msg: "موافقة للقتال والغارات ويكره فيها الجماع والسفر ولبس الجدد",
    },
    {
      planet: "شمس",
      status: "good",
      msg: "صالحة لمجامعة الحراير والإبتناء بعد البكر والنقلة ولباس الجدد",
    },
    { planet: "زهرة", status: "ex", msg: "تصلح للسفر ولبس الجدد وشرب الدواء" },
    {
      planet: "عطارد",
      status: "normal",
      msg: "تصلح للسفر براً وبحراً ومن جامع ولد له ذكر وتصلح للبس الجدد ومكاتبة الملوك والابتداء بكل عمل صالح",
    },
  ],
  "1light": [
    // ساعات الاثنين صباحا
    {
      planet: "قمر",
      status: "good",
      msg: "تصلح لغرس الشجر والركوب الى قرب واتخاذ النساء ويكره فيها بيع الرقيق والمواشي وتصلح لإجراء الانهار وحفر الآبار وزراعة الرياحين",
    },
    {
      planet: "زحل",
      status: "bad",
      msg: "ردية يكره فيها الابتداء لكل عمل والسفر والزراعة وبيع الرقيق وشراه",
    },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح للزراعة ولبس الجدد والركوب الى الملوك والشراء للرقيق والدواب والبناء واستعمال العمال وحمل الهدايا الى الملوك ",
    },
    {
      planet: "مريخ",
      status: "bad",
      msg: "تصلح للفصد والعلاج بالحديد وعمل الجراح والخروج الى الحرب وصرف من كان عدو وملك ويكره بيع الرقيق ",
    },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح للركوب الى الملوك ومكاتبتهم ولشراء الرقيق والدواب التي ركبت",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "تصلح للأعمال المتعلقة بالنساء ولشراء الإماء ولبس الجدد وعمل البِر وفرش الرياحين وغسل الرأس والزينة والتطيب",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "تصلح لتعليم الصبيان ومكاتبة الأصدقاء وتزويق المجالس وتسليم الحلي الى الصائغ",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "يكره فيها اتخاذ الرقيق والسفر والتزويج وحفر الآبار",
    },
    {
      planet: "زحل",
      status: "bad",
      msg: "مكروهة لكل ابتداء إلا لابتياع الغنم والسفر واستعمال الرعاة",
    },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح لاتخاذ الولائم ولقاء الملوك وتصلح لابتياع الخدم والدواب ومكاتبة الملوك والأشراف",
    },
    {
      planet: "مريخ",
      status: "bad",
      msg: "يصلح للقتال والضرب والهدم والحرث ويكره فيها بيع الرقيق والابتداء بالإعمال التي لا يراد وحسن الثناء فيها",
    },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح لخزن الغلّاة في الأهر والزراعة والحصاد ويكره فيها السفر الى بعد",
    },
  ],
  "2night": [
    // ساعات الثلاثاء مساءا
    {
      planet: "زهرة",
      status: "ex",
      msg: "تصلح لكل شيء يتعلق بالنساء ولبس الجدد والسفر والنقلة",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "تصلح لأمور الجباية ويكره لمن يتعلق الكتاب والجماع ولبس الجدد",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "صالحة لأمور النساء ولبس الجدد واتخاذ الفرش والنقلة",
    },
    {
      planet: "زحل",
      status: "bad",
      msg: "يكره فيها الابتداء بالأمور المتعلقة بالنساء خاصة ولكل عمل",
    },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح لأمور النساء ومن أراد ولداً ذكراً جامع فيها امرأته وتصلح للبس الجدد ويكره السفر والنقلة فيها",
    },
    { planet: "مريخ", status: "bad", msg: "يكره فيها الجماع ولبس الجدد" },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح للمجاهرة الى الملوك وقصدهم والجماع ولبس الجدد والنقلة من موضع الى موضع من الدار التي فيها",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "مكروهة الابتداء بأمور النساء وتصلح للركوب الى قريب",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "تصلح للمكاتبات ومجامعة النساء ولبس الجدد والنقلة",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "موافقة لأمور الإماء والحراير ولبس الجدد والنقلة",
    },
    {
      planet: "زحل",
      status: "bad",
      msg: "تصلح للابتداء بالأعمال والسفر والمكاتبات ولبس الجدد",
    },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح لابتداء الأعمال التي تطلب حسن العاقبة فيها",
    },
  ],
  "2light": [
    // ساعات الثلاثاء صباحا
    {
      planet: "مريخ",
      status: "bad",
      msg: "تصلح للحجامة والفصد ومطالبة العمال ويكره بيع الرقيق والتزويج والجماع وإيداع الإسرار لأن من أفشا سره فيها الى أحد كشفه",
    },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح للركوب وللقاء الملوك ومجامعة النساء ولبس الثياب وتفصيلها وصياغة الحلي وطلب الحوائج",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "تصلح لأمور النساء وغرس الشجر وزيادة الإخوان وشراء المواشي",
    },
    { planet: "عطارد", status: "normal", msg: "مكروهة" },
    {
      planet: "قمر",
      status: "good",
      msg: "تصلح لطلب الصيد من الماء وشراء الإبل ودخول الحمّام واستعمال النورة ويكره شراء الرقيق والجماع",
    },
    {
      planet: "زحل",
      status: "bad",
      msg: "مكروهة لكل ابتداء والأصلح أن لا يعمل فيها شيء",
    },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح للقاء الملوك والأشراف والعظماء والمكاتبات واستحلاف من يراد صدقه وتصلح لمكافحة الأضداد وشراء الخدم",
    },
    {
      planet: "مريخ",
      status: "bad",
      msg: "تكره لشرب الداوء وبيع الرقيق وشراء كل متاع",
    },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح للركوب الى قرب ويكره السلف وتحمد للقاء الملوك ",
    },
    { planet: "زهرة", status: "ex", msg: "تصلح للمكاتبات" },
    {
      planet: "عطارد",
      status: "normal",
      msg: "تصلح لتعليم الصبيان ولشراء السيف ولبس الجدد والسفر ومحاسبة العمال والقهارمة والمكاتبات",
    },
    { planet: "قمر", status: "good", msg: "تكره لشراء الرقيق والدواب" },
  ],
  "3night": [
    // ساعات الاربعاء مساءا
    { planet: "زحل", status: "bad", msg: "يكره فيها الابتدآت لجميع الأشياء" },
    {
      planet: "مشتري",
      status: "ex",
      msg: "يصلح لكل عمل ولبس الجدد والسفر والنقلة إلا الزواجة",
    },
    { planet: "مريخ", status: "bad", msg: "ردية" },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح لكل ابتداء ولجماع الحراير والاماء ولبس الجدد وللسفر",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "تصلح لزيارات النساء ولكل ما يتعلق بهن وللزينة والسفر ",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "تصلح للمكاتبات وادخار المال ومجامعة الحراير",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "موافقة للإماء غير موافقة لأمور الحراير",
    },
    { planet: "زحل", status: "bad", msg: "تكره لكل عمل" },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح للتزويج واتخاذ السراري والزينة وكل ابتداء",
    },
    { planet: "مريخ", status: "bad", msg: "تكره لكل عمل" },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح للقاء الملوك والسفر براً وبحراً وشرب الدواء",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "تصلح للسفر براً وبحراً وللجماع ولاسيما لطلب الولد وللزينة ولبس الجدد والنقلة من موضع الى موضع",
    },
  ],
  "3light": [
    // ساعات الاربعاء صباحا
    {
      planet: "عطارد",
      status: "normal",
      msg: "جيدة مباركة وتصلح لاتخاذ الإماء محاسبة المعاملين والقهارمة والعمال وشراء الوصايف وكل صغيرة",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "تصلح لشراء الولايد والاتصال بالحراير واستعمال العمال وللبناء وشراء الدواب التي قد ركبت",
    },
    { planet: "زحل", status: "bad", msg: "مكروهة لاستعمال الرعاة والعبيد" },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح تًحْمل الهدايا الى الملوك وشراء الرقيق ولا سيما مايراد لاتخاذ الأولاد وللمكاتبات ومصادقة الأخلاء فإن المودة تدوم ",
    },
    {
      planet: "مريخ",
      status: "bad",
      msg: "تصلح للحرب ويكره فيها الحجامة وتصلح للتأديب وشراء الماشية",
    },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح لشراء العبيد والبقر والزراعة وبناء الاصطبلات والمطابخ ونصب التنور ويكره فيها المكاتبات والصيد والسفر والنقلة",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "تصلح لشراء الرقيق والمواشي وغرس الكرم والشجر ولبس الجدد والجماع والتطيب والسفر براً وبحراً ومن بدأ فيه بالحرب غلب",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "مكروهة لا تصلح لشيء من الأعمال كلها",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "تصلح للسفر البعيد الذي لا يراجع منه سريعاً غانماً سالماً ولشراء الرقيق والماشية والسفر القريب ولاتخاذ الولائم",
    },
    {
      planet: "زحل",
      status: "bad",
      msg: "تصلح لشراء الرقيق والحمير والبراذين والركوب الى قريب ويكره الجماع",
    },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح للمجامعة وطلب الولد وشراء الرقيق والسفر ولبس الجدد والزينة وغسل الرأس والبناء وغرس الشجر",
    },
    { planet: "مريخ", status: "bad", msg: "ساعة ردية" },
  ],
  "4night": [
    // ساعات الخميس مساءا
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح لكل ابتداء من سفر وجماع وتزويج وزينة ونقلة وغرس شجر ودخول عروس على زوجها",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "تصلح بما يتعلق بالنساء والزينة وشرب الدواء",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "تصلح للمكاتبات والنقلة وللجماع والولائم وشرب الدواء",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "جيدة لأمور الإماء والزينة ولبس الجدد",
    },
    { planet: "زحل", status: "bad", msg: "ردية" },
    {
      planet: "مشتري",
      status: "ex",
      msg: "ساعة سعد لكل ابتداء وللزينة ولبس الجدد وشرب الدواء ",
    },
    { planet: "مريخ", status: "bad", msg: "ساعة الحروب تكره لكل عمل" },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح لشرب الدواء والابتداء لكل عمل والنقلة ولبس الجدد",
    },
    { planet: "زهرة", status: "ex", msg: "موافقة لأمور النساء ولكل عمل" },
    { planet: "عطارد", status: "normal", msg: "تكره لكل عمل خاصة السفر" },
    {
      planet: "قمر",
      status: "good",
      msg: "موافقة لأمور الإماء والأخوان وشرب الدواء ولبس الجدد والسفر",
    },
    {
      planet: "زحل",
      status: "bad",
      msg: "يكره فيها الاعمال لاسيما السفر وبالله الإعانة",
    },
  ],
  "4light": [
    // ساعات الخميس صباحا
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح لكل ابتداء يراد حسن العاقبة فيه وهي ساعة العلم وتصلح الركوب الى الملوك ولقاء الأشراف واتخاذ الأصدقاء والجماع لولد الذكور والسفر ",
    },
    {
      planet: "مريخ",
      status: "bad",
      msg: "ردية إلا للقتال وشراء السلاح واتخاذه",
    },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح للقاء الملوك ومكاتباتهم ومخالطتهم وطلب الشفاعات وبيع الرقيق والدواب والبناء ولبس الجدد ودخول الحمّام والتأديب",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "تصلح للتزويج واستعمال الحلى واتخاذ الآلات ولبس الجدد والشراء والسفر واتخاذ المواشي والدواب",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "محمودة لكل عمل ولاسيما للقاء الملوك والمكاتبات والمحاسبات وتعليم الصبيان وشراء العبيد والبراذين ",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "تصلح لحفر الآبار وركوب السفر وشراء الجواري ويكره لقاء الملوك",
    },
    {
      planet: "زحل",
      status: "bad",
      msg: "وهي ان كانت لزحل فإنها تحمد لاتخاذ القهارمة والإماء والعبيد والدواب والبناء والركوب الى نزهة ومساحة الأرضين",
    },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح لشراء الدواب واتخاذ الخيل السوابق ويكره جماع الحراير",
    },
    {
      planet: "مريخ",
      status: "bad",
      msg: "من استعمل فيها غلاماً خانه ويكره لبس الجدد وقطعها وكل ابتداء",
    },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح للقاء الملوك واستعمال القهارمة واتخاذ الدواب وابتداء الحروب",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "يكره فيها شراء الجواري والعبيد ولبس الجدد والتزويج وكل ابتداء",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "يكره فيها البيع والشراء واستعمال القهارمة ",
    },
  ],
  "5night": [
    // ساعات الجمعة مساءا
    {
      planet: "قمر",
      status: "good",
      msg: "تصلح للابتداء بأسباب النساء ومجامعتهن وشرب الدواء والسفر",
    },
    { planet: "زحل", status: "bad", msg: "مكروهة لكل عمل" },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح لطلب الولد ولبس الجدد والسفر وشرب الدواء ويكره غير ذلك",
    },
    { planet: "مريخ", status: "bad", msg: "مذمومة لكل عمل" },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح بالابتداء بكل عمل والاجتماع مع النساء وشرب الدواء ",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "مباركة تصلح لأسباب النساء وكل ابتداء",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "تصلح للمكاتبات ولبس الجدد واتخاذ الفرش والملاحف الجدد",
    },
    { planet: "قمر", status: "good", msg: "تكره فيها الاعمال" },
    { planet: "زحل", status: "bad", msg: "يكره فيها كل الأعمال" },
    { planet: "مشتري", status: "ex", msg: "مسعودة لكل ابتداء وعمل" },
    { planet: "مريخ", status: "bad", msg: "تكره فيها كل الأعمال" },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح لكل ابتداء سيما لمن يتعلق بالرؤساء ولقاهم ولبس الجدد",
    },
  ],
  "5light": [
    // ساعات الجمعة صباحا
    {
      planet: "زهرة",
      status: "ex",
      msg: "مباركة لكل عمل ولاسيما للتزويج وشراء الخدم والدواب والبناء والسفر براً وبحراً والخروج في نزهة والزيارة والغرس",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "تصلح للمكاتبات والتعليم والمحاسبات وبيع الحلي واتخاذ الخدم وحمل الهدايا ويكره فيها شراء الجواري",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "تحمد لشراء الإماء وحفر النهر والآبار وشراء الأرضي  وعمارة البساتين والسفر وشراء المواشي ولبس الجدد",
    },
    { planet: "زحل", status: "bad", msg: "يكره فيها كل ابتداء" },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تحمد للقاء العظماء ولبس الجدد والزراعة والحصاد واستعمال العمال والمكاتبات ويكره فيها التزويج والجباية",
    },
    {
      planet: "مريخ",
      status: "bad",
      msg: "تصلح للابتداء بالحرب واتخاذ السلاح ولبسه ويكره فيها شراء الرقيق والدواب والكلام فيما يراد كتمانه",
    },
    {
      planet: "شمس",
      status: "good",
      msg: "تحمد للركوب الى مكان بعيد واتخاذ الأصدقاء وحمل الهدايا وركوب السفن وشراء الارضين وإحداث البناء وشراء الرقيق والدواب ",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "تحمد لشراء الرقيق والدواب والسفر وعمارة البساتين واتخاذ الحمام وخطبة النساء ولبس الجدد",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "تحمد للقاء الرؤساء وتعليم الصبيان وفرش الجدد وشراء الوصايف واتخاذ الولائم",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "تحمد لشراء المواشي وكرا الأنهار والسفن واتخاذ القهارمة والأمناء ومساحة الأرضين وكنز الأموال",
    },
    {
      planet: "زحل",
      status: "bad",
      msg: "تحمد لشراء البراذين والإبل ويكره فيها شراء الرقيق والسفر ويصلح لكيل الحنطة وجميع الحبوب",
    },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح لجميع الابتدآت من ركوب الدواب والسفن وشراء الرقيق والأكل والشرب وحلق الرأس والجماع ودخول الحمام",
    },
  ],
  "6night": [
    // ساعات السبت مساءا
    { planet: "مريخ", status: "bad", msg: "تكره لكل عمل" },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح للصدقة والزيارة في الأهل ولبس الجدد وتفقد الأملاك ومكاتبة العظماء ومجامعة الحراير دون الإماء",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "ومن ابتنى بها عذراء حبلت سريعاً واستولت على ماله",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "ويكره فيها المكاتبات والبناء وأمور النساء والجماع والسفر ولبس الجدد",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "يختار للسفر والجماع واستعمال كل جديد والمعاتبة على الذنوب ",
    },
    {
      planet: "زحل",
      status: "bad",
      msg: "يكره فيها كل ابتداء وكل عمل من الاعمال",
    },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح لجماع الحراير ويكره لجماع الإماء ويصلح لبس الجدد والاختفاء من السلطان ان كان يطلب الانسان لسوء غير",
    },
    { planet: "مريخ", status: "bad", msg: "ردية" },
    {
      planet: "شمس",
      status: "good",
      msg: "لا تصلح لمجامعة الحراير وتحمد لمجامعة الإماء",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "تصلح للجماع ولبس الجدد والسفر القريب المدة",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "تصلح للسفر البعيد والجماع ومن حبل فيها من النساء ولدت سلطاناً أو عظيم الشأن في قومه ",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "تصلح للسفر في البر والبحر ويكره فيها طلب الولد",
    },
  ],
  "6light": [
    // ساعات السبت صباحا
    { planet: "زحل", status: "bad", msg: "تصلح للقاء العظماء" },
    {
      planet: "مشتري",
      status: "ex",
      msg: "تصلح للقاء الرؤساء واتخاذ الأصدقاء والتزويج ولبس الجدد وشرب الدواء وغرس الشجر ويكره فيها أخذ الشعر ",
    },
    { planet: "مريخ", status: "bad", msg: "مكروهة لكل عمل" },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح للقاء العظماء والرؤساء واستعمال العمال وشراء الدواب ولبس الجدد ويكره فيها البناء وتصلح النقلة الى مسكن جديد",
    },
    {
      planet: "زهرة",
      status: "ex",
      msg: "تصلح للنساء والزينة والتعطر وشراء الجواري وغرس الرياحين",
    },
    {
      planet: "عطارد",
      status: "normal",
      msg: "تصلح لتعليم الصبيان ومكاتبة الرؤساء ومحاسبة الأصحاب وكتب التعاويذ والرقى والنظر في العلوم ولأمور النساء ويكره شراء الرقيق",
    },
    {
      planet: "قمر",
      status: "good",
      msg: "تصلح لحفر البير والأنهار وغرس الأشجار وفتح باب الحانوت وأكل الولائم واتخاذ العمال وشرب الدواء وشراء الدواب وركوبها",
    },
    { planet: "زحل", status: "bad", msg: "يكره فيها كل عمل وكل ابتداء" },
    {
      planet: "مشتري",
      status: "ex",
      msg: "يحمد فيها الركوب واتخاذ الخدم والغلمان والزراعة",
    },
    {
      planet: "مريخ",
      status: "bad",
      msg: "تصلح للحرب ولبس السلاح ويكره فيها الشراء",
    },
    {
      planet: "شمس",
      status: "good",
      msg: "تصلح للقاء الملوك وشراء الدواب والسفر والابتداء",
    },
    { planet: "زهرة", status: "ex", msg: "تصلح للجماع وغرس الشجر ولبس الجدد" },
  ],
};
